---
layout:     post
title:      RAID 6 操作手册
subtitle:   SERVER RAID
date:       2017-12-26
author:     Axu
header-img: img/post-bg-coffee.jpeg
catalog: true
tags:
    - RAID
---

## RAID 6操作手册
### 名词解释
> - **Disk Group：磁盘组，这里相当于是阵列，例如配置了一个RAID5，就是一个磁盘组** 
> - **VD(Virtual Disk)虚拟磁盘，虚拟磁盘可以不使用阵列的全部容量，也就是说一个磁盘组可以分为多个VD**    
> - **PD(Physical Disk)物理磁盘** 
> - **HS(Hot Spare) 热备**
> - **Mgmt：管理**
> - **Ctrl: 控制**
> - **Total Free Capacity(总可用容量)**
> - **No Configuration Present!(目前没有配置！)**
### 背景描述
> - **适用于数据中心，信息中心等对数据安全级别要求比较高的企业**
> - **在RAID-5基础上增加一位检验信息,提供更好的安全性，允许坏两块盘**
> - **最终可用容量为(N-2)x单盘容量**
> - **读取快,因多了一个校验盘,写入性能差**
> - **RAID控制器在设计上更加复杂，成本更高**
### 操作平台
> - **LSI RAID卡**
> - **最少4块硬盘**
### 操作步骤
> 1. 按照屏幕下方的虚拟磁盘管理器提示，在VD Mgmt菜单（可以通过CTRL+P/CTRL+N切换菜单），按F2展开虚拟磁盘创建菜单 
![image](https://i.imgur.com/5sAs0FW.png)
> 2.在虚拟磁盘创建窗口，按回车键选择"Create New VD"创建新虚拟磁盘
![image](https://i.imgur.com/lbByzKR.png)
> 3.在RAID Level选项按回车，可以出现能够支持的RAID级别，RAID卡能够支持的级别有RAID0/1/5/6/10/50，根据具体配置的硬盘数量不同，这个位置可能出现的选项也会有所区别。
选择不同的级别，选项会有所差别。选择好需要配置的RAID级别（我们这里以RAID6为例），按回车确认。
![image](https://i.imgur.com/AkUjpZz.png)
<<<<<<< HEAD
> 4.确认`RAID级别`以后，按`下方向键`，将光标移至`Physical Disks`列表中，上下移动至需要选择的硬盘位置，按空格键来选择（移除）列表中的硬盘，当选择的硬盘数量达到这个RAID级别所需的要求时，`Basic Settings`的`VD Size`中可以显示这个RAID的默认容量信息。有`X`标志为选中的硬盘。
选择完硬盘后按`Tab`键，可以将光标移至`VD Size`栏，`VD Size可以手动设定大小，也就是说`可以不用将所有的容量配置在一个虚拟磁盘中`。
=======
> 4.确认RAID级别以后，按向下方向键，将光标移至Physical Disks列表中，上下移动至需要选择的硬盘位置，按空格键来选择（移除）列表中的硬盘，当选择的硬盘数量达到这个RAID级别所需的要求时，Basic Settings的VD Size中可以显示这个RAID的默认容量信息。有X标志为选中的硬盘。
选择完硬盘后按Tab键，可以将光标移至VD Size栏，VD Size可以手动设定大小，也就是说可以不用将所有的容量配置在一个虚拟磁盘中。如果这个虚拟磁盘没有使用我们所配置的RAID5阵列所有的容量，剩余的空间可以配置为另外的一个虚拟磁盘，但是配置下一个虚拟磁盘时必须返回VD Mgmt创建（可以参考第13步，会有详细说明）。VD Name根据需要设置，也可为空。 
>>>>>>> parent of f3c891e... update
**注：各RAID级别最少需要的硬盘数量，RAID0=1 RAID1=2 RAID5=3 RAID6=4 RAID10=4 RAID50=6**
![image](https://i.imgur.com/bk589jf.png)
> 5.修改`高级设置`，选择完`VD Size`后，可以按`向下方向键`，或者`Tab键`，将光标移至`Advanced Settings`处，按`空格键`开启（禁用）高级设置。如果开启后`（红框处有`X`标志为开启）`，可以修改`Stripe Element Size`(条带大小)，以及阵列的`Read Policy`与`Write Policy`，`Initialize`处可以选择**是否**在阵列配置的同时进行初始化。
高级设置`默认`为关闭（不可修改），如果没有`特殊要求`，`建议`不要修改此处的设置。
![image](https://i.imgur.com/vYmhcOs.png)
6.上述的配置确认完成后，按`Tab`键，将光标移至`OK`处，按回车，会出现如下的提示，如果是一个`全新的阵列`，建议进行`初始化`操作，如果配置阵列的目的是为了`恢复之前的数据`，则`不要`进行初始化。按`回车`确认即可继续。
![image](https://i.imgur.com/Jv1TuJD.png)
7.配置完成后，会返回至`VD Mgmt`主界面，将光标移至图中`Virtual Disk 0`处，按回车。
![image](https://i.imgur.com/ECMUxgk.png)
>  8.可以看到刚才配置成功的虚拟磁盘信息，查看完成后按esc键可以返回主界面
![image](https://i.imgur.com/sWwmgsB.png)
### 注意事项
> - 如果是一个全新的阵列，建议进行初始化操作，如果配置阵列的目的是为了恢复之前的数据，则不要进行初始化。
> - 在生产环境中,请尽量少用**Clear Config**
